<?php

// quizデータ
$quiz = [];

$q = 1;
$quiz[$q] = [];
$quiz[$q]['q'] = '日本の国土の西のはしにある島の名前は？';
$quiz[$q]['c'] = [];
$quiz[$q]['c'][1] = '与那国島';
$quiz[$q]['c'][2] = '南鳥島';
$quiz[$q]['c'][3] = '沖ノ鳥島';
$quiz[$q]['c'][4] = '択捉島';
$quiz[$q]['a'] = 1;

$q = 2;
$quiz[$q] = [];
$quiz[$q]['q'] = '桓武(かんむ)天皇が794年に移した都は？';
$quiz[$q]['c'] = [];
$quiz[$q]['c'][1] = '平城京';
$quiz[$q]['c'][2] = '長岡京';
$quiz[$q]['c'][3] = '桓武京';
$quiz[$q]['c'][4] = '平安京';
$quiz[$q]['a'] = 4;

$q = 3;
$quiz[$q] = [];
$quiz[$q]['q'] = '瀬戸大橋は何県と何県を結ぶ橋でしょう？';
$quiz[$q]['c'] = [];
$quiz[$q]['c'][1] = '山口ー福岡';
$quiz[$q]['c'][2] = '岡山ー香川';
$quiz[$q]['c'][3] = '徳島ー兵庫県';
$quiz[$q]['c'][4] = '広島ー愛媛';
$quiz[$q]['a'] = 2;

$q = 4;
$quiz[$q] = [];
$quiz[$q]['q'] = '初代ポケットモンスターで一番最初に手に入る"ひでんわざ"と言えば？';
$quiz[$q]['c'] = [];
$quiz[$q]['c'][1] = 'たいあたり';
$quiz[$q]['c'][2] = 'れんぞくぎり';
$quiz[$q]['c'][3] = 'いあいぎり';
$quiz[$q]['c'][4] = 'しんくうぎり';
$quiz[$q]['a'] = 3;

$q = 5;
$quiz[$q] = [];
$quiz[$q]['q'] = '本当にある苗字「わたぬき」さんはどの漢字？';
$quiz[$q]['c'] = [];
$quiz[$q]['c'][1] = '十月一日';
$quiz[$q]['c'][2] = '八月一日';
$quiz[$q]['c'][3] = '六月一日';
$quiz[$q]['c'][4] = '四月一日';
$quiz[$q]['a'] = 4;

$q = 6;
$quiz[$q] = [];
$quiz[$q]['q'] = '天空の城ラピュタの敵役として登場するムスカ大佐の年齢は？';
$quiz[$q]['c'] = [];
$quiz[$q]['c'][1] = '28歳';
$quiz[$q]['c'][2] = '32歳';
$quiz[$q]['c'][3] = '38歳';
$quiz[$q]['c'][4] = '42歳';
$quiz[$q]['a'] = 1;

$q = 7;
$quiz[$q] = [];
$quiz[$q]['q'] = 'サザエさんに出てくる、マスオさんの会社仲間であるアナゴさんの年齢は？';
$quiz[$q]['c'] = [];
$quiz[$q]['c'][1] = '28歳';
$quiz[$q]['c'][2] = '34歳';
$quiz[$q]['c'][3] = '40歳';
$quiz[$q]['c'][4] = '48歳';
$quiz[$q]['a'] = 1;

$q = 8;
$quiz[$q] = [];
$quiz[$q]['q'] = 'ドラえもんが初めて20世紀にやってきたときに食べたものはなんでしょうか？';
$quiz[$q]['c'] = [];
$quiz[$q]['c'][1] = 'あんパン';
$quiz[$q]['c'][2] = 'どら焼き';
$quiz[$q]['c'][3] = 'おもち';
$quiz[$q]['c'][4] = 'せんべい';
$quiz[$q]['a'] = 3;

$q = 9;
$quiz[$q] = [];
$quiz[$q]['q'] = '1973年に格付けの改定で2級から1級に昇格したボルドーのシャトーは？';
$quiz[$q]['c'] = [];
$quiz[$q]['c'][1] = 'シャトー・ムートン・ロートシルト';
$quiz[$q]['c'][2] = 'シャトー・ラトゥール';
$quiz[$q]['c'][3] = 'シャトー・ラフィット・ロートシルト';
$quiz[$q]['c'][4] = 'シャトー・オーブリオン';
$quiz[$q]['a'] = 1;

$q = 10;
$quiz[$q] = [];
$quiz[$q]['q'] = '次のスポーツのうちボールを前に投げると反則になるのはどれ？';
$quiz[$q]['c'] = [];
$quiz[$q]['c'][1] = 'バスケットボール';
$quiz[$q]['c'][2] = 'ラグビー';
$quiz[$q]['c'][3] = 'アメリカンフットボール';
$quiz[$q]['c'][4] = '水球';
$quiz[$q]['a'] = 2;
